#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b29956ba-4dd8-43b6-990a-e2a81528b92d]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f2e01476-5a7e-4cb4-8be0-dc8d72a632e5]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0ea0dbdb-f06f-48e5-98cd-a4c145cb135a]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2a594a06-15d5-4d7c-9fce-8248ab7259ff]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=71146a13-fb16-4606-9d00-a7e021036455]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=97184e33-5413-40f5-9404-65ea2afca6c9]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c2e2e710-9f0a-4d10-a63a-3d9926aa5548]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8b99af0f-993e-46c3-8341-74e3124343db]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=611eb206-5f42-444d-99f8-0e67d30e66e5]
module.keycloak_dev.module.onestopauth.module.client_zz-2444.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=32531f90-040c-44e8-a3cf-5438b59d6ef9]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5514c7ef-d293-4ea1-bbf6-c49a334bd192]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ef330158-03fc-4eab-8631-5e3297e13e43]
module.keycloak_dev.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=db3a8cb2-016e-40b7-a905-5e274f606e96]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=383fe8ea-de3a-4915-a52f-860fbf1bbe80]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=968ff5f0-ec51-44c6-9fbc-bfa5b12d7710]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b02dc5ec-a1b7-4c26-8e2f-2e41b8f3ffe4]
module.keycloak_dev.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ec1e3c7c-ee70-41ae-88df-fa012dd9a06a]
module.keycloak_dev.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a2925fcf-162c-4b59-bdf5-a84b0686f70f]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8f0198fb-0455-4811-820c-80e74acf4e7c]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=81776136-87a7-49cc-8414-b47235b1ff03]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=56200527-3909-4c02-b468-5f91156755fc]
module.keycloak_dev.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c74a0031-aabb-4557-9292-c88af0fa9605]
module.keycloak_dev.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bbef5ee2-09af-4e7d-97f1-1284679cce4b]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a0d7fbf1-2c74-42f7-a6e2-febb22930ebd]
module.keycloak_dev.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=76ed71b4-542f-4e28-8711-8d33edfc8ef6]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0e86d674-6b15-43ad-9a59-4ed67e5716c1]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e28c54bd-bc2c-45e8-8989-ce583c6cc4c9]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=55535ce7-35e1-41ed-a676-c4bd95901b73]
module.keycloak_dev.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0e7da164-2acd-4903-a7b4-56d4741a6036]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=156bc55b-210e-4f01-a713-0e6c11cf0361]
module.keycloak_dev.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=dab3edc5-9e20-4338-9570-e2e4857dfbae]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7caeb33f-4332-4959-84aa-4a8fc39d3cf7]
module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1ddb02b8-f198-4775-8c88-a72eace09720]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=05224e67-b8fa-443b-871f-acb3040e8bbb]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8922455-5068-4300-add2-dc1604ebf9ee]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0f6f8dd9-b6af-48e0-8662-7a4de1b675c4]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8a1c0c79-82b1-4433-aec2-04139bd9e83c]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9bbbb147-8a84-49b3-a0bf-3ef8da612f54]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=fc9681b6-d792-4ba9-95b0-a51bebcdf52c]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=99ffa2ac-d2f0-4891-a4cb-e5995275f66a]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7b14c264-b280-422b-b073-ac2200b070e7]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a492ac28-fa52-4d5f-9505-8b1f100a4dda]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=57933b07-9c45-4129-b9f0-46f1d910e1c8]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=306160cd-a478-4c56-b164-e4c00fd957f3]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ad0f24f5-94ad-47d9-90a3-e9c280a6637b]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2e998904-774d-48f6-a932-19867e13e464]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=b0170550-2ca6-456d-90ed-279ed25d33a5]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ce475809-4d67-4814-b5cc-a79e02daae50]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c9eaf799-089e-4c0a-aa22-8f13b61591c4]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c03015ab-3612-4e49-8129-1d9036d99cf4]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c31fd301-394d-4828-bd45-ec0751004103]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0aa8bbff-cf4a-4079-a4b9-e068d4a23a29]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=74c7c7f9-e7af-41e3-8186-b3d5e5e80639]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1445a013-c23c-467f-8264-28a36387e9c6]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d463262b-4b9a-4aa2-bace-6b58abea7093]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b14318d7-2fef-448d-a616-2379a8be02d4]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2a0d3020-53e5-4125-8c8f-9ccc07f16046]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=95edc824-5533-47ea-9224-6997adf57152]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3fb093c0-f7d1-4ba1-987e-363814f65908]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c912cdfa-fc24-440e-ae83-f9d26f34277b]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=889affb6-1e3a-4390-ba71-b0e0846dae0d]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bd2afc16-a3a5-474a-8b47-2b30fbd6676f]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2fd1bff9-837d-4bb5-84ce-d67fe5865a67]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=351edce8-24a2-4788-a2d0-fb683e0d86c8]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e5b5688e-2148-4497-a192-6a81b6808246]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1c98999a-8146-44a6-83a1-ebfe31d04f97]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=82ee2743-d087-4731-99e8-70588207b11a]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=af50e464-c02f-4992-bfb6-3c31435b03ef]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=74f44654-4961-4268-ab51-3ae574413368]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f950c894-b251-426b-a97d-6b62fb7320c9]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6a455955-558a-4a9b-b4f9-244792055a25]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=8e085133-311f-4317-849b-9a3e55f9abe9]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ddf77f5a-8101-4fca-aa54-6390449a7f03]
module.keycloak_dev.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a16cf377-4615-480a-bce1-51efb50dfcaf]
module.keycloak_dev.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dd617ca7-a541-4cbb-9705-c461063c7813]
module.keycloak_dev.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fcfcf6f6-f1e3-4fd5-b1f0-e96622d25d1e]
module.keycloak_dev.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7addef10-3fe8-4a78-b18d-da571197412b]
module.keycloak_dev.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5e641e62-f666-4ae8-acce-63fd6f17801b]
module.keycloak_dev.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=926b33b4-ecb2-4e1a-b1e8-7f27266eaa9b]
module.keycloak_dev.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d8ff5964-aa80-41af-8c21-9261010c0d2c]
module.keycloak_dev.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=25f0ebd0-2a7d-4508-a203-33e1086fa924]
module.keycloak_dev.module.onestopauth.module.client_idir-azure-3796.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b5979477-2f87-43ec-841c-29461eff6267]
module.keycloak_dev.module.onestopauth.module.client_idir-azure-3796.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2e2e23be-db94-4528-b9a4-281624eae1f4]
module.keycloak_dev.module.onestopauth.module.client_idir-azure-3796.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=42be6ded-fe54-4139-ae9c-066d24b60f10]
module.keycloak_dev.module.onestopauth.module.client_idir-azure-3796.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=115d737f-d2f4-45bb-87a2-4daaf88f2487]
module.keycloak_dev.module.onestopauth.module.client_idir-azure-3796.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ea842bec-22b1-44d1-b68a-8f5a05dd7f7f]
module.keycloak_dev.module.onestopauth.module.client_idir-azure-3796.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c6e1bcb3-b7b4-4f9e-86bb-43f44d58ba03]
module.keycloak_dev.module.onestopauth.module.client_idir-azure-3796.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4a354f0c-193f-486b-bddd-3eefc893731b]
module.keycloak_dev.module.onestopauth.module.client_idir-azure-3796.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=c16ea373-1dcb-4974-aa1e-b7855c84afc4]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.onestopauth.module.client_feb-2-test-team-access-to-json-4918.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "3b8a90dc-f5bd-4a7f-a5cb-56a881a685ba"
        name                                     = "feb-2-test-team-access-to-json-4918"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "feb-3-test-team-access-to-files-4951"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "feb-3-test-team-access-to-files-4951"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://www.test.ca",
        ]
      + web_origins                              = [
          + "+",
          + "http://www.test.ca",
        ]
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_lkjflasjdfklasdfasdf-1.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "lkjflasjdfklasdfasdf-1"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_lkjflasjdfklasdfasdf-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_lkjflasjdfklasdfasdf-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_lkjflasjdfklasdfasdf-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_lkjflasjdfklasdfasdf-1.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "lkjflasjdfklasdfasdf-1"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_lkjflasjdfklasdfasdf-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_lkjflasjdfklasdfasdf-1.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_lkjflasjdfklasdfasdf-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_lkjflasjdfklasdfasdf-1.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "lkjflasjdfklasdfasdf-1"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "lkjflasjdfklasdfasdf-1"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:3000",
        ]
      + web_origins                              = [
          + "+",
          + "http://localhost:3000",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3456 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*